# ClearCover Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ClearCover Property
ParameterTypeId Class See Also
---
"Rebar Cover"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ClearCover { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ClearCover As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ClearCover {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace